// Напишите программу, которая на вход принимает число и выводит квадрат этого числа

int value = 11;
int result = value*value;
Console.WriteLine(result);

